external/swak/examples/Lagrangian/functionObjects/angledDuctWithBalls/0/alphat
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
    back
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
    wall
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
    porosityWall
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
