external/swak/examples/Lagrangian/functionObjects/angledDuctWithBalls/0/epsilon
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    front
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }
    back
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }
    wall
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }
    porosityWall
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }
    inlet
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ************************************************************************* //
