external/swak/examples/Lagrangian/functionObjects/angledDuctWithBalls/0/k
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    front
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }
    back
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }
    wall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }
    porosityWall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}


// ************************************************************************* //
